## Basics

In [2]:
import pandas as pd 
import pandas as pd 
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
output = pd.DataFrame(dict1)
output
# dict1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

> ### **Question 1 : Display top 3 rows in Data**

In [5]:
output.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

> ### **Question 2 : Display last 3 rows in Data**

In [4]:
output.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

> ### **Question 3 : Find shape of our data**

In [5]:
output.shape

(7, 3)

In [6]:
print(f"Number of rows in Dataset are {output.shape[0]}")
print(f"Number of columns in Dataset are {output.shape[1]}")

Number of rows in Dataset are 7
Number of columns in Dataset are 3

> ### **Question 4 : Display information of Data**

In [7]:
output.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

> ### **Question 5 : Check null values in dataset**

In [8]:
output.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [10]:
# Null value count overall
output.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [11]:
# NUll value count column wise
output.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
# NUll value count row wise
output.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

> ### **Question 6 : Get overall statistics of Dataset**

In [13]:
output.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [14]:
# Describing all columns
output.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

> ### **Question 7 : Find unique values from gender column**

In [15]:
output['Gender'].unique()

array(['Male', 'Female'], dtype=object)

> ### **Question 8 : number unique values from gender column**

In [16]:
output['Gender'].nunique()

2

> ### **Question 9 : count unique values from gender column**

In [17]:
output['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

> ### **Question 10 : Find total number of students whose marks are betweeen 90 to 100**

In [19]:
output['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [20]:
output['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [23]:
Que10 = output[output['Marks']>=90]
Que10

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [25]:
output[(output['Marks']>=90) & (output['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
len(Que10)

4

In [27]:
# Using between method
output['Marks'].between(90,100)
# Here 90 and 100 are inclusive

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [28]:
sum(output['Marks'].between(90,100))

4

> ### **Question 11 : Display Average marks**

In [29]:
output['Marks'].mean()

92.14285714285714

In [30]:
output['Marks'].min()

83

In [31]:
output['Marks'].max()

99

> ### **Question 12 : Use apply method**

In [32]:
def halfMarks(x):
    return x/2

In [33]:
output['Marks'].apply(halfMarks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [34]:
output['Half_marks'] = output['Marks'].apply(halfMarks)
output

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [35]:
# Applying lambda function
output['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [36]:
# Length of strings in in name column
output['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

> ### **Question 13 : Use map function**

In [42]:
# Changing male as m and female as f
output['Shorted'] = output['Gender'].map({
    'Male':'m',
    'Female':'f',
})
output

      Name  Marks  Gender  Half_marks Shorted
0  Priyang     98    Male        49.0       m
1   Aadhya     89  Female        44.5       f
2   Krisha     99  Female        49.5       f
3   Vedant     87    Male        43.5       m
4   Parshv     90    Male        45.0       m
5   Mittal     83  Female        41.5       f
6  Archana     99  Female        49.5       f

> ### **Question 14 : Drop the columns**

In [44]:
copied = output.copy()
copied

      Name  Marks  Gender  Half_marks Shorted
0  Priyang     98    Male        49.0       m
1   Aadhya     89  Female        44.5       f
2   Krisha     99  Female        49.5       f
3   Vedant     87    Male        43.5       m
4   Parshv     90    Male        45.0       m
5   Mittal     83  Female        41.5       f
6  Archana     99  Female        49.5       f

In [65]:
copied.drop(['Shorted','Half_marks'],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [66]:
copied

      Name  Marks  Gender  Half_marks Shorted
0  Priyang     98    Male        49.0       m
1   Aadhya     89  Female        44.5       f
2   Krisha     99  Female        49.5       f
3   Vedant     87    Male        43.5       m
4   Parshv     90    Male        45.0       m
5   Mittal     83  Female        41.5       f
6  Archana     99  Female        49.5       f

In [67]:
# Make permenant change
copied.drop(['Half_marks','Shorted'],axis=1,inplace=True)

In [68]:
copied

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

> ### **Question 15 : Print name of columns and print indexes info**

In [69]:
output

      Name  Marks  Gender Shorted
0  Priyang     98    Male       m
1   Aadhya     89  Female       f
2   Krisha     99  Female       f
3   Vedant     87    Male       m
4   Parshv     90    Male       m
5   Mittal     83  Female       f
6  Archana     99  Female       f

In [70]:
output.columns

Index(['Name', 'Marks', 'Gender', 'Shorted'], dtype='object')

In [71]:
output.index

RangeIndex(start=0, stop=7, step=1)

> ### **Question 16 : Sort dataframe as per marks**

In [72]:
output.sort_values(by=['Marks'])

      Name  Marks  Gender Shorted
5   Mittal     83  Female       f
3   Vedant     87    Male       m
1   Aadhya     89  Female       f
4   Parshv     90    Male       m
0  Priyang     98    Male       m
2   Krisha     99  Female       f
6  Archana     99  Female       f

In [73]:
output.sort_values(by=['Marks'],ascending=False)

      Name  Marks  Gender Shorted
2   Krisha     99  Female       f
6  Archana     99  Female       f
0  Priyang     98    Male       m
4   Parshv     90    Male       m
1   Aadhya     89  Female       f
3   Vedant     87    Male       m
5   Mittal     83  Female       f

> ### **Question 17 : print names and marks of female students**

In [74]:
output[output['Gender'].isin(['Female'])]

      Name  Marks  Gender Shorted
1   Aadhya     89  Female       f
2   Krisha     99  Female       f
5   Mittal     83  Female       f
6  Archana     99  Female       f

In [75]:
output[output['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99